[
  {
    "id": "fc06fa05-d196-4795-9b93-42b731e2d3e6",
    "displayName": "Enforce MFA for O365",
    "createdDateTime": "2021-06-09T16:24:51.4519998Z",
    "modifiedDateTime": "2024-07-30T00:07:36.8714704Z",
    "state": "enabled",
    "sessionControls": null,
    "conditions": {
      "userRiskLevels": [],
      "signInRiskLevels": [],
      "clientAppTypes": [
        "exchangeActiveSync",
        "browser",
        "mobileAppsAndDesktopClients",
        "other"
      ],
      "servicePrincipalRiskLevels": [],
      "insiderRiskLevels": null,
      "platforms": null,
      "devices": null,
      "clientApplications": null,
      "authenticationFlows": null,
      "applications": {
        "includeApplications": [
          "Office365"
        ],
        "excludeApplications": [
          "05c7dc53-eb06-4b1e-aee9-980f35fcc42d",
          "fc108d3f-543d-4374-bbff-c7c51f651fe5"
        ],
        "includeUserActions": [],
        "includeAuthenticationContextClassReferences": [],
        "applicationFilter": null
      },
      "users": {
        "includeUsers": [
          "All"
        ],
        "excludeUsers": [],
        "includeGroups": [],
        "excludeGroups": [],
        "includeRoles": [],
        "excludeRoles": [],
        "includeGuestsOrExternalUsers": null,
        "excludeGuestsOrExternalUsers": null
      },
      "locations": {
        "includeLocations": [
          "All"
        ],
        "excludeLocations": [
          "076a9aca-1c71-4e44-9dd2-665244f3168c"
        ]
      }
    },
    "grantControls": {
      "operator": "OR",
      "builtInControls": [
        "mfa"
      ],
      "customAuthenticationFactors": [],
      "termsOfUse": [],
      "authenticationStrength@odata.context": "https://graph.microsoft.com/v1.0/$metadata#identity/conditionalAccess/policies('fc06fa05-d196-4795-9b93-42b731e2d3e6')/grantControls/authenticationStrength/$entity",
      "authenticationStrength": null
    }
  },
  {
    "id": "13f08436-6493-4400-8e79-b8558f71f88a",
    "displayName": "Microsoft-managed: Multifactor authentication for per-user multifactor authentication users",
    "createdDateTime": "2023-12-11T21:36:12.3701804Z",
    "modifiedDateTime": "2024-10-07T21:05:35.4119531Z",
    "state": "enabled",
    "sessionControls": null,
    "conditions": {
      "userRiskLevels": [],
      "signInRiskLevels": [],
      "clientAppTypes": [
        "all"
      ],
      "servicePrincipalRiskLevels": [],
      "insiderRiskLevels": null,
      "platforms": null,
      "devices": null,
      "clientApplications": null,
      "authenticationFlows": null,
      "applications": {
        "includeApplications": [
          "All"
        ],
        "excludeApplications": [],
        "includeUserActions": [],
        "includeAuthenticationContextClassReferences": [],
        "applicationFilter": null
      },
      "users": {
        "includeUsers": [
          "9825c06d-c470-4768-a232-0930f6cfcd0c",
          "3977f7ae-07dc-4eb2-9915-5c0ddf76f674",
          "03baa94b-bf8a-46c8-84bd-a68ad543bdde",
          "07dce7e9-a209-460c-b12e-4848d98b269b",
          "827ce9ef-80b9-4064-be4a-ebff1d59f2bd",
          "4d69cb13-9b06-4227-8743-96a3df799e91",
          "dce7142e-c69e-42b3-9ec2-36cf780e2cc1",
          "5659f364-9bac-4f39-b869-99f82c8c44c6",
          "a3bd6c23-94ed-4b7a-bfdf-65223a7f525e",
          "7fa4a656-6a76-4951-b8fd-c87cee3bb67a"
        ],
        "excludeUsers": [
          "13672252-04d2-4101-ae13-1e8c0dfdc472"
        ],
        "includeGroups": [],
        "excludeGroups": [],
        "includeRoles": [],
        "excludeRoles": [],
        "includeGuestsOrExternalUsers": null,
        "excludeGuestsOrExternalUsers": null
      },
      "locations": {
        "includeLocations": [
          "All"
        ],
        "excludeLocations": [
          "AllTrusted"
        ]
      }
    },
    "grantControls": {
      "operator": "OR",
      "builtInControls": [],
      "customAuthenticationFactors": [],
      "termsOfUse": [],
      "authenticationStrength@odata.context": "https://graph.microsoft.com/v1.0/$metadata#identity/conditionalAccess/policies('13f08436-6493-4400-8e79-b8558f71f88a')/grantControls/authenticationStrength/$entity",
      "authenticationStrength": {
        "id": "00000000-0000-0000-0000-000000000002",
        "createdDateTime": "2021-12-01T08:00:00Z",
        "modifiedDateTime": "2021-12-01T08:00:00Z",
        "displayName": "Multifactor authentication",
        "description": "Combinations of methods that satisfy strong authentication, such as a password + SMS",
        "policyType": "builtIn",
        "requirementsSatisfied": "mfa",
        "allowedCombinations": [
          "windowsHelloForBusiness",
          "fido2",
          "x509CertificateMultiFactor",
          "deviceBasedPush",
          "temporaryAccessPassOneTime",
          "temporaryAccessPassMultiUse",
          "password,microsoftAuthenticatorPush",
          "password,softwareOath",
          "password,hardwareOath",
          "password,sms",
          "password,voice",
          "federatedMultiFactor",
          "microsoftAuthenticatorPush,federatedSingleFactor",
          "softwareOath,federatedSingleFactor",
          "hardwareOath,federatedSingleFactor",
          "sms,federatedSingleFactor",
          "voice,federatedSingleFactor"
        ],
        "combinationConfigurations@odata.context": "https://graph.microsoft.com/v1.0/$metadata#identity/conditionalAccess/policies('13f08436-6493-4400-8e79-b8558f71f88a')/grantControls/authenticationStrength/combinationConfigurations",
        "combinationConfigurations": []
      }
    }
  },
  {
    "id": "71c25c9d-14b7-40a1-951e-694c19cd0377",
    "displayName": "Bypass MFA Admins",
    "createdDateTime": "2024-01-10T05:21:37.6714057Z",
    "modifiedDateTime": null,
    "state": "enabledForReportingButNotEnforced",
    "sessionControls": null,
    "conditions": {
      "userRiskLevels": [],
      "signInRiskLevels": [],
      "clientAppTypes": [
        "all"
      ],
      "servicePrincipalRiskLevels": [],
      "insiderRiskLevels": null,
      "platforms": null,
      "devices": null,
      "clientApplications": null,
      "authenticationFlows": null,
      "applications": {
        "includeApplications": [
          "None"
        ],
        "excludeApplications": [],
        "includeUserActions": [],
        "includeAuthenticationContextClassReferences": [],
        "applicationFilter": null
      },
      "users": {
        "includeUsers": [
          "None"
        ],
        "excludeUsers": [],
        "includeGroups": [],
        "excludeGroups": [],
        "includeRoles": [],
        "excludeRoles": [],
        "includeGuestsOrExternalUsers": null,
        "excludeGuestsOrExternalUsers": null
      },
      "locations": {
        "includeLocations": [
          "AllTrusted"
        ],
        "excludeLocations": []
      }
    },
    "grantControls": {
      "operator": "OR",
      "builtInControls": [
        "block"
      ],
      "customAuthenticationFactors": [],
      "termsOfUse": [],
      "authenticationStrength@odata.context": "https://graph.microsoft.com/v1.0/$metadata#identity/conditionalAccess/policies('71c25c9d-14b7-40a1-951e-694c19cd0377')/grantControls/authenticationStrength/$entity",
      "authenticationStrength": null
    }
  },
  {
    "id": "a132fbdb-4cc0-4b8d-874d-282b3e972a66",
    "displayName": "Microsoft-managed: Block device code flow",
    "createdDateTime": "2026-03-10T19:02:10.2154727Z",
    "modifiedDateTime": "2026-04-27T19:10:09.3460425Z",
    "state": "enabled",
    "sessionControls": null,
    "conditions": {
      "userRiskLevels": [],
      "signInRiskLevels": [],
      "clientAppTypes": [
        "all"
      ],
      "servicePrincipalRiskLevels": [],
      "insiderRiskLevels": null,
      "platforms": null,
      "locations": null,
      "devices": null,
      "clientApplications": null,
      "applications": {
        "includeApplications": [
          "All"
        ],
        "excludeApplications": [],
        "includeUserActions": [],
        "includeAuthenticationContextClassReferences": [],
        "applicationFilter": null
      },
      "users": {
        "includeUsers": [
          "All"
        ],
        "excludeUsers": [],
        "includeGroups": [],
        "excludeGroups": [],
        "includeRoles": [],
        "excludeRoles": [],
        "includeGuestsOrExternalUsers": null,
        "excludeGuestsOrExternalUsers": null
      },
      "authenticationFlows": {
        "transferMethods": "deviceCodeFlow"
      }
    },
    "grantControls": {
      "operator": "OR",
      "builtInControls": [
        "block"
      ],
      "customAuthenticationFactors": [],
      "termsOfUse": [],
      "authenticationStrength@odata.context": "https://graph.microsoft.com/v1.0/$metadata#identity/conditionalAccess/policies('a132fbdb-4cc0-4b8d-874d-282b3e972a66')/grantControls/authenticationStrength/$entity",
      "authenticationStrength": null
    }
  }
]